// Project: FT61FC3x_LVD.prj
// Device:  FT61FC3x
// Memory:  PROM=3Kx14, SRAM=256, EEPROM=128                             
// Description: 设置PA1为LVD检测脚，当PA1为高时，VDD正常，DemoPortOut输出LOW，
//           	当PA1为低时，VDD掉到了所设置的低电压以下，DemoPortOut输出HIGH。
//
// RELEASE HISTORY
// VERSION DATE     DESCRIPTION
// 1.0	   24-1-16	初版
// 1.1	   24-1-24  更新版本号 
// 1.2     24-2-26  更新文件头描述
//
//                  FT61FC35  SOP20
//                 ----------------
//  GND-----------|1(GND)   (VDD)20|------------VDD        
//  NC------------|2(PC1)   (PA0)19|------------NC 
//  NC------------|3(PC0)   (PA1)18|---------LVDIN
//  NC------------|4(PB7)   (PA2)17|------------NC
//  NC------------|5(PB6)   (PA3)16|------------NC
//  NC------------|6(PB5)   (PA4)15|---DemoPortOut
//  NC------------|7(PB4)   (PA5)14|------------NC     
//  NC------------|8(PB3)   (PA6)13|------------NC
//  NC------------|9(PB2)   (PA7)12|------------NC
//  NC------------|10(PB1)  (PB0)11|------------NC
//                 ----------------   
// 
//*********************************************************
#include "SYSCFG.h"
//=========================================================
#define  unchar       unsigned char 

#define  DemoPortOut  PA4
#define  LVDIN        PA1   
/*-------------------------------------------------
 *  函数名：POWER_INITIAL
 *	功能：  上电系统初始化
 *  输入：  无
 *  输出：  无
 --------------------------------------------------*/	
void POWER_INITIAL (void) 
{	 
	OSCCON = 0B01110001;	       //IRCF=111=16MHz/2T=8MHz，0.125us
    OPTION = 0B00001000;           //Bit3=1 WDT，Bit[2:0]=000=WDT RATE 1:1
	INTCON = 0;  			       //暂禁止所有中断
	PORTA  = 0B00000000;		
	TRISA  = 0B00000010;	       //PA输入输出 0-输出 1-输入
							       //PA4-OUT PA1-IN		
	PORTC  = 0B00000000; 	
	TRISC  = 0B00000000;	       //PC输入输出 0-输出 1-输入  
								
	WPUA   = 0B00000010;           //PA端口上拉控制 1-开上拉 0-关上拉
							       //开PA1上拉
	WPUC   = 0B00000000;           //PC端口上拉控制 1-开上拉 0-关上拉	
}
/*-------------------------------------------------
 * 函数名：LVD_INITIAL
 * 功能：  LVD功能初始化
 * 输入：  无
 * 输出：  无       
 -------------------------------------------------*/
void LVD_INITIAL (void) 
{    
    PCON = 0B01000011;              //检测电压设置为3.0V 
	//Bit[7:4]: 低电压侦测选择位 0100-3.0V
    //Bit3:     低电压侦测使能。 1-使能 0-关闭
    //Bit2:     低电压标志位，只读。 1-VDD掉了设置电压以下 0-VDD正常
    //Bit1:     上电复位标志，低有效。0-发生了上电复位 1-没有发生
    //Bit0:     低电压复位标志，低有效。0-发生了低电压复位 1-没有发生
    
    LVDCON = 0B00001010;            //LVD输入脚选择PA1
    //Bit4:     LVDW极性 0-检测电压<设置电压 1-检测电压>设置电压
    //Bit3:     LVD消抖 0-关闭 1-使能
    //Bit[2:0]：LVD输入脚选择  010-PA1
}
