// Project: FT61FC3x_MSCK.prj
// Device:  FT61FC3x
// Memory:  PROM=3Kx14, SRAM=256, EEPROM=128                             
// Description: 程序中读取快时钟测量慢时钟数据
//
// RELEASE HISTORY
// VERSION DATE     DESCRIPTION
// 1.0	   24-1-16	初版
// 1.1	   24-1-24  更新版本号 
// 1.2     24-2-26  更新文件头描述
//
//                  FT61FC35  SOP20
//                 ----------------
//  VDD-----------|1(VDD)   (VSS)20|-----------VSS     
//  NC------------|2(PC1)   (PA0)19|------------NC 
//  NC------------|3(PC0)   (PA1)18|------------NC
//  NC------------|4(PB7)   (PA2)17|------------NC
//  NC------------|5(PB6)   (PA3)16|------------NC
//  NC------------|6(PB5)   (PA4)15|------------NC
//  NC------------|7(PB4)   (PA5)14|------------NC
//  NC------------|8(PB3)   (PA6)13|------------NC
//  NC------------|9(PB2)   (PA7)12|------------NC
//  NC------------|10(PB1)  (PB0)11|------------NC
//                 ----------------   
// 
//*********************************************************
#include "SYSCFG.h"
//=========================================================
//DEFINE
//=========================================================
#define 	unchar     	unsigned char 
#define 	unint       unsigned int
 
volatile    unint      	TestBuff;
/*-------------------------------------------------
 *  函数名：POWER_INITIAL
 *	功能：  上电系统初始化
 *  输入：  无
 *  输出：  无
 --------------------------------------------------*/	
void POWER_INITIAL (void) 
{
	OSCCON = 0B01110001;	       //IRCF=111=16MHz/2T=8MHz，0.125us
    OPTION = 0B00001000;           //Bit3=1 WDT，Bit[2:0]=000=WDT RATE 1:1
	INTCON = 0;  			       //暂禁止所有中断
	PORTA  = 0B00000000;		
	TRISA  = 0B00000000;	       //PA输入输出 0-输出 1-输入
							 
	PORTC  = 0B00000000; 	
	TRISC  = 0B00000000;	       //PC输入输出 0-输出 1-输入  
								
	WPUA   = 0B00000000;           //PA端口上拉控制 1-开上拉 0-关上拉
	WPUC   = 0B00000000;           //PC端口上拉控制 1-开上拉 0-关上拉
                      
    MSCON0 = 0B00000000;		   	
    //Bit5: 低功耗模式。 0-关闭 1-使能
    //Bit4: 内部时钟输出CLKO功能输出引脚控制位。 0-CLKO映射到PB0 1-CLKO映射到PA2
    //Bit3: UCFG1<1:0>为01时此位有意义。 0-关闭LVR 1-使能LVR
    //Bit2: 快时钟测量慢周期的平均模式。 0-关闭 1-使能
    //Bit1：快时钟测量慢周期启动位。 0-关闭 1-启动
    //Bit0: 睡眠时T2CK保持工作。 0-NO 1-YES
}
/*----------------------------------------------------
 *	函数名：DelayUs
 *	功能：  短延时函数 
 *	输入：  Time 延时时间长度 延时时长Time us
 *	输出：  无 
 ----------------------------------------------------*/
void DelayUs(unsigned char Time)
{
	unsigned char a;
	for(a=0;a<Time;a++)
	{
		NOP();
	}
}                  
/*----------------------------------------------------
 *	函数名：DelayMs
 *	功能：  短延时函数--16M-2T--大概快1%左右.
 *	输入：  Time 延时时间长度 延时时长Time ms
 *	输出：  无 
 ----------------------------------------------------*/
void DelayMs(unsigned char Time)
{
	unsigned char a,b;
	for(a=0;a<Time;a++)
	{
		for(b=0;b<5;b++)
		{
		 	DelayUs(197);           //快1%
		}
	}
}
/*-------------------------------------------------
 *  函数名：SlowTimeTest
 *	功能：  快时钟测量慢时钟
 *  输入：  无
 *  输出：  慢时钟时钟测量值TestTime
		    不开平均模式慢时钟频率=16M/TestTime(2T)
		    开平均模式慢时钟频率=16M/TestTime/4(2T)
 --------------------------------------------------*/
unint SlowTimeTest()
{
	unint TestTime;
	TMR2ON = 1;				       //开定时器2
	CKMIF = 0;			           //清零标志位
	CKMAVG = 0;				       //关闭平均模式 
							       //注:打开平均模式输出数据为四个周期的时钟数(单周期*4)
	CKCNTI = 1; 			       //使能快时钟测量位,开始测量
	while(!CKMIF);
	CKMIF = 0;                     //清零标志位
	TestTime = SOSCPRH << 8;
	TestTime = TestTime + SOSCPRL;
	return TestTime;
}
