// Project: FT61FC3x_INT.prj
// Device:  FT61FC3x
// Memory:  PROM=3Kx14, SRAM=256, EEPROM=128                             
// Description: 程序中DemoPortOut(PA2)输出100帧50Hz的占空比为50%的方波后，
//           	MCU进入睡眠，等待外部中断(PA4)的发生；
//		    	当外部中断触发后，重复以上流程；
//
// RELEASE HISTORY
// VERSION DATE     DESCRIPTION
// 1.0	   24-1-16	初版
// 1.1	   24-1-24  更新版本号 
// 1.2     24-2-26  更新文件头描述
//
//                  FT61FC35  SOP20
//                 ----------------
//  GND-----------|1(GND)   (VDD)20|------------VDD        
//  NC------------|2(PC1)   (PA0)19|------------NC
//  NC------------|3(PC0)   (PA1)18|------------NC
//  NC------------|4(PB7)   (PA2)17|---DemoPortOut
//  NC------------|5(PB6)   (PA3)16|------------NC
//  NC------------|6(PB5)   (PA4)15|-----------INT
//  NC------------|7(PB4)   (PA5)14|------------NC
//  NC------------|8(PB3)   (PA6)13|------------NC
//  NC------------|9(PB2)   (PA7)12|------------NC
//  NC------------|10(PB1)  (PB0)11|------------NC
//                 ----------------   
// 
//===========================================================
#include	"SYSCFG.h";
//===========================================================
//Variable definition
//===========================================================
#define 	unchar       unsigned char 
#define     DemoPortOut  PA2

unchar 	    ReadAPin;
unchar      FCount=0;
/*----------------------------------------------------
 *	函数名：DelayUs
 *	功能：  短延时函数 
 *	输入：  Time延时时间长度 延时时长Time Us
 *	返回：  无 
 ----------------------------------------------------*/
void DelayUs(unsigned char Time)
{
	unsigned char a;
	for(a=0;a<Time;a++)
	{
		NOP();
	}
}                  
/*----------------------------------------------------
 *	函数名：DelayMs
 *	功能：  短延时函数--16M-2T--大概快1%左右.
 *	输入：  Time延时时间长度 延时时长Time ms
 *	返回：  无 
 ----------------------------------------------------*/
void DelayMs(unsigned char Time)
{
	unsigned char a,b;
	for(a=0;a<Time;a++)
	{
		for(b=0;b<5;b++)
		{
		 	DelayUs(197); 	//快1%
		}
	}
}
/*-------------------------------------------------
 *  函数名：POWER_INITIAL
 *	功能：  上电系统初始化
 *  输入：  无
 *  输出：  无
 --------------------------------------------------*/	
void POWER_INITIAL (void) 
{ 
	OSCCON = 0B01110001;	//IRCF=111=16MHz/2T=8MHz，0.125us					 	
	INTCON = 0;  			//暂禁止所有中断
    OPTION = 0B00001000;	//Bit3=1 WDT，Bit[2:0]=000= WDT RATE 1:1 
    
	PORTA  = 0B00000000;		
	TRISA  = 0B00010000;	//PA输入输出 0-输出 1-输入
							//PA2-OUT PA4-IN                      				
	PORTC  = 0B00000000; 	
	TRISC  = 0B00000000;	//PC输入输出 0-输出 1-输入  
								
	WPUA   = 0B00010000;    //PA端口上拉控制 1-开上拉 0-关上拉
     						//开PA4上拉
	WPUC   = 0B00000000;    //PC端口上拉控制 1-开上拉 0-关上拉
                            
	ANSEL0 = 0B00000000;    
                          
	}
/*-------------------------------------------------
 *  函数名：interrupt
 *	功能：  中断程序
 *  输入：  无
 *  输出：  无
 --------------------------------------------------*/
void interrupt ISR(void)
{
    if(INTF==1)
    {
      ReadAPin = PORTA; 
      INTF = 0;
      INTE = 0; 
	} 
    DelayMs(10);  			 //10ms 
}
/*-------------------------------------------------
 *  函数名：INT_INITIAL
 *	功能：  中断初始化函数
 *  输入：  无
 *  输出：  无
 --------------------------------------------------*/
 void INT_INITIAL(void)
{
	TRISA4 =1;               //设置PA4输出
    ReadAPin = PORTA;        //读清除错误匹配
	INTEDG =1;               //设置PA4 INT为上升沿触发 
	INTF =0;                 //清PA4 INT中断标志位
	INTE =1;                 //使能PA4 INT中断
}
