// Project: FT61FC3x_PWM.prj
// Device:  FT61FC3x
// Memory:  PROM=3Kx14, SRAM=256, EEPROM=128                             
// Description: 上电后所有PWM口输出，仿真时的烧录口除外。
//
// RELEASE HISTORY
// VERSION DATE     DESCRIPTION
// 1.0	   24-1-16	初版
// 1.1	   24-1-24  更新版本号 
// 1.2     24-2-26  更新文件头描述
//
//                  FT61FC35  SOP20
//                 ----------------
//  GND-----------|1(GND)   (VDD)20|------------VDD        
//  NC------------|2(PC1)   (PA0)19|--------[P1A2N] 
//  NC------------|3(PC0)   (PA1)18|---------[P1A2]
//  P1B1----------|4(PB7)   (PA2)17|---------[P1D2]
//  [P1A1N]-------|5(PB6)   (PA3)16|---------[P1D1]
//  [P1A1]--------|6(PB5)   (PA4)15|-------------NC
//  NC------------|7(PB4)   (PA5)14|-------------NC
//  P1D0----------|8(PB3)   (PA6)13|-----------P1A0
//  P1C0----------|9(PB2)   (PA7)12|-----------P1B0
//  P1A0N---------|10(PB1)  (PB0)11|---------[P1C1]
//                 ----------------   
// 
//===========================================================
#include	"SYSCFG.h";
/*-------------------------------------------------
 *  函数名：POWER_INITIAL
 *	功能：  上电系统初始化
 *  输入：  无
 *  输出：  无
 --------------------------------------------------*/	
void POWER_INITIAL (void) 
{	 
	OSCCON = 0B01110001;	//IRCF=111=16MHz/2T=8MHz,0.125uS
					 		//Bit0=1,系统时钟为内部振荡器
					 		//Bit0=0,时钟源由FOSC<2:0>决定即编译选项时选择
    TRISA=0;
    TRISB=0;                      
	PORTA=0;
    PORTB=0;	
}


/*-------------------------------------------------
 * 函数名：    PWM_INITIAL
 * 功能：      设置PWM口输出 
 * 相关寄存器：T2CON0 T2CON1 TMR2 PR2 P1OE P1OE2
 *             P1ADT P1BDT P1CDT P1DDT 
 -------------------------------------------------*/
void PWM_INITIAL (void) 
{    
    T2CON0=0;               //Bit[6:3]=TOUTPS  后分频比	0000=1:1~1111=1:16
                            //Bit2=TMR2ON	   1=TIMER2打开	0=关闭
                            //Bit[1:0]=T2CKPS  预分频比 00=1:1 01=1:4 1x=1:16
                                                    
        
    T2CON1=0X02;            //时钟源为2xHIRC
                               
	PR2H=0; 
    PR2L=31;
    
    P1OE2=0B11100110;			
							// Bit7=P1D2OE	1=P1D2输出到PA2	 0=不输出
                            // Bit6=P1D1OE	1=P1D1输出到PA3	 0=不输出
                            // Bit5=P1D0OE	1=P1D0输出到PB3	 0=不输出
                            // Bit2=P1C1OE	1=P1C1输出到PB0	 0=不输出
                            // Bit1=P1B1OE	1=P1B1输出到PB7	 0=不输出
	TMR2H=0;
    TMR2L=0;
    
	P1OE=0B11111111;        // Bit7=P1C0OE	1=P1C0输出到PB2	 0=不输出
                            // Bit6=P1B0OE	1=P1B0输出到PA7	 0=不输出
                            // Bit5=P1A2NOE 1=P1A2N输出到PA0 0=不输出
                            // Bit4=P1A2OE	1=P1A2输出到PA1  0=不输出
                            // Bit3=P1A1NOE	1=P1A1N输出到PB6 0=不输出
                            // Bit2=P1A1OE	1=P1A1输出到PB5	 0=不输出
                            // Bit1=P1A0NOE	1=P1A0N输出到PB1 0=不输出
                            // Bit1=P1A0OE	1=P1A0输出到PA6	 0=不输出
                            
    P1CON=0B00000001;        //死区时间=Bit<6:0>*(1/Fosc)*2=1*(1/16000000)*2=0.125uS
    
    P1POL=0B00000000;       // Bit7=P1C0P输出极性	1=反向	 0=不反向
                            // Bit6=P1B0P输出极性	1=反向	 0=不反向
                            // Bit5=P1A2NP输出极性	1=反向	 0=不反向
                            // Bit4=P1A2P输出极性	1=反向	 0=不反向
                            // Bit3=P1A1NP输出极性	1=反向	 0=不反向
                            // Bit2=P1A1P输出极性	1=反向	 0=不反向
                            // Bit1=P1A0NP输出极性	1=反向	 0=不反向
                            // Bit1=P1A0P输出极性	1=反向	 0=不反向
                            
    P1POL2=0B11100110;      // Bit7=P1D2P输出极性	1=反向	 0=不反向
                            // Bit6=P1D1P输出极性	1=反向	 0=不反向
                            // Bit5=P1D0P输出极性	1=反向	 0=不反向
                            // Bit2=P1C1P输出极性	1=反向	 0=不反向
                            // Bit1=P1B1P输出极性	1=反向	 0=不反向
    
    P1ADTH=0;
    P1ADTL =3;              //P1A占空比3/32
    
	P1BDTH=0;
    P1BDTL=10;              //P1B占空比10/32
    
   	P1CDTH=0;
   	P1CDTL=26;              //P1C占空比26/32
    
   	P1DDTH=0;
    P1DDTL =29;             //P1D占空比29/32

	T2CON0=T2CON0|0x04;     //Timer2使能
  
}
//===========================================================
//函数名：main
//输入：  无
//输出：  无
//===========================================================
main()
{
    POWER_INITIAL();
    PWM_INITIAL();
    while(1)
    {
        
	}
}
//===========================================================
