// Project: FT61FC3x_WDT.prj
// Device:  FT61FC3x
// Memory:  PROM=3Kx14, SRAM=256, EEPROM=128                             
// Description: 程序中开启看门狗并将看门狗时间设置为32ms
//		    	a. 主函数先在DemoPortOut脚输出一个高3ms低3ms的信号，
//		    	b. 然后循环输出高1ms低1ms，500Hz的信号。
//		    	如果不在主程序中清看门狗，则每隔32ms单片机复位后，会重复输出a+b信号；
//		    	如果在主函数中清看门狗，则一直输出b信号
//
// RELEASE HISTORY
// VERSION DATE     DESCRIPTION
// 1.0	   24-1-16	初版
// 1.1	   24-1-24  更新版本号 
// 1.2     24-2-26  更新文件头描述
//
//                  FT61FC35  SOP20
//                 ----------------
//  GND-----------|1(GND)   (VDD)20|------------VDD        
//  NC------------|2(PC1)   (PA0)19|------------NC 
//  NC------------|3(PC0)   (PA1)18|------------NC
//  NC------------|4(PB7)   (PA2)17|------------NC
//  NC------------|5(PB6)   (PA3)16|------------NC
//  NC------------|6(PB5)   (PA4)15|---DemoPortOut
//  NC------------|7(PB4)   (PA5)14|------------NC
//  NC------------|8(PB3)   (PA6)13|------------NC
//  NC------------|9(PB2)   (PA7)12|------------NC
//  NC------------|10(PB1)  (PB0)11|------------NC
//                 ----------------   
// 
//===========================================================
#include "SYSCFG.h"
//===========================================================
#define  unchar         unsigned char 

#define  DemoPortOut	PA4   
/*-------------------------------------------------
 *  函数名：POWER_INITIAL
 *	功能：  上电系统初始化
 *  输入：  无
 *  输出：  无
 --------------------------------------------------*/	
void POWER_INITIAL (void) 
{	 
	OSCCON = 0B01110001;	//IRCF=111=16MHz/2T=8MHz，0.125us
    OPTION = 0B00001000;    //Bit3=1 WDT，Bit[2:0]=000=WDT RATE 1:1
	INTCON = 0;  			//暂禁止所有中断
	PORTA  = 0B00000000;		
	TRISA  = 0B00000000;	//PA输入输出 0-输出 1-输入
							//PA4-OUT					
	PORTC  = 0B00000000; 	
	TRISC  = 0B00000000;	//PC输入输出 0-输出 1-输入  
								
	WPUA   = 0B00000000;    //PA端口上拉控制 1-开上拉 0-关上拉						
	WPUC   = 0B00000000;    //PC端口上拉控制 1-开上拉 0-关上拉
}
/*------------------------------------------ 
 * 函数名：DelayUs
 * 功能：  短延时函数
 * 输入：  Time 延时时间长度 延时时长Time us
 * 返回：  无 
--------------------------------------------*/
void DelayUs(unsigned char Time)
{
	unsigned char a;
	for(a=0;a<Time;a++)
	{
		NOP();
	}
}                  
/*------------------------------------------ 
 * 函数名：DelayMs
 * 功能：  短延时函数--16M-2T--大概快1%左右.
 * 输入：  Time 延时时间长度 延时时长Time ms
 * 返回：  无 
--------------------------------------------*/
void DelayMs(unsigned char Time)
{
	unsigned char a,b;
	for(a=0;a<Time;a++)
	{
		for(b=0;b<5;b++)
		{
		 	DelayUs(197); 		//快1%
		}
	}
}
/*-------------------------------------------------
 * 函数名：WDT_INITIAL
 * 功能：  初始化设置看门狗32ms时间复位
 * 寄存器：OPTION WDTCON
 * 设置WDT定时时长=(1/32000)*16位预分频比*8位后分频比
 *                =(1/32000)*1024*1=32ms
 -------------------------------------------------*/
void WDT_INITIAL (void) 
{
  
	CLRWDT();  				//清看门狗
	OPTION = 0B00001000;    //分频电路分配给WDT，8位后分频比为1:1
	WDTCON = 0B00001011;	//16位预分频比为1:1024，使能看门狗定时器
}
