// Project: FT61FC3x_LVD_PWM1.prj
// Device:  FT61FC3x
// Memory:  PROM=3Kx14, SRAM=256, EEPROM=128                             
// Description: 低电压检测与PWM1联动，检测输出可作为PWM1的刹车源。
//           	当检测到LVD（PA0管脚检测）事件时，PWM1刹车，当LVD事件消除时，
//		    	PWM口继续输出波形。
//
// RELEASE HISTORY
// VERSION DATE     DESCRIPTION
// 1.0	   24-1-16	初版
// 1.1	   24-1-24  更新版本号 
// 1.2     24-2-26  更新文件头描述
//
//                  FT61FC35  SOP20
//                 ----------------
//  GND-----------|1(GND)   (VDD)20|------------VDD        
//  NC------------|2(PC1)   (PA0)19|---------LVDIN 
//  NC------------|3(PC0)   (PA1)18|--------[P1A2]
//  P1B1----------|4(PB7)   (PA2)17|--------[P1D2]
//  [P1A1N]-------|5(PB6)   (PA3)16|--------[P1D1]
//  [P1A1]--------|6(PB5)   (PA4)15|------------NC
//  NC------------|7(PB4)   (PA5)14|------------NC
//  P1D0----------|8(PB3)   (PA6)13|----------P1A0
//  P1C0----------|9(PB2)   (PA7)12|----------P1B0
//  P1A0N---------|10(PB1)  (PB0)11|--------[P1C1]
//                 ----------------   
// 
//********************************************************
#include "SYSCFG.h"
//=======================================================
//
//=======================================================
#define  LVDIN        PA0 
/*-------------------------------------------------
 *  函数名：POWER_INITIAL
 *	功能：  上电系统初始化
 *  输入：  无
 *  输出：  无
 --------------------------------------------------*/	
void POWER_INITIAL (void) 
{
	OSCCON = 0B01110001;	//IRCF=111=16MHz/2T=8MHz，0.125us
    OPTION = 0B00001000;	//Bit3=1 WDT，Bit[2:0]=000=WDT RATE 1:1
	INTCON = 0;  			//暂禁止所有中断
    
	PORTA  = 0B00000000;		
	TRISA  = 0B00000001;	//PA输入输出 0-输出 1-输入
							//PA0-IN			
	PORTC  = 0B00000000; 	
	TRISC  = 0B00000000;	//PC输入输出 0-输出 1-输入  
								
	WPUA   = 0B00000001;    //PA端口上拉控制 1-开上拉 0-关上拉
							//开PA0上拉
	WPUC   = 0B00000000;    //PC端口上拉控制 1-开上拉 0-关上拉
}
/*-------------------------------------------------
 * 函数名称：   PWM1_INITIAL
 * 功能：       初始化设置PWM 
 * 相关寄存器： T2CON0 T2CON1 TMR2 PR2 P1OE P1OE2
 *              P1ADT P1BDT P1CDT P1DDT 
 -------------------------------------------------*/
void PWM1_INITIAL (void) 
{    
     T2CON0=0;              //Bit[6:3]=TOUTPS  后分频比 0000=1:1~1111=1:16
                            //Bit2=TMR2ON	   1=TIMER2打开	0=关闭
                            //Bit[1:0]=T2CKPS  预分频比 00=1:1 01=1:4 1x=1:16
                                  
    T2CON1=0X02;            //时钟源为2xHIRC
                               
	PR2H=0; 
    PR2L=31;
    
    P1OE2=0B11100110;			
							// Bit7=P1D2OE	1=P1D2输出到PA2	 0=不输出
                            // Bit6=P1D1OE	1=P1D1输出到PA3	 0=不输出
                            // Bit5=P1D0OE	1=P1D0输出到PB3	 0=不输出
                            // Bit2=P1C1OE	1=P1C1输出到PB0	 0=不输出
                            // Bit1=P1B1OE	1=P1B1输出到PB7	 0=不输出
	TMR2H=0;
    TMR2L=0;
    
	P1OE=0B11111111;        // Bit7=P1C0OE	1=P1C0输出到PB2	 0=不输出
                            // Bit6=P1B0OE	1=P1B0输出到PA7	 0=不输出
                            // Bit5=P1A2NOE 1=P1A2N输出到PA0 0=不输出
                            // Bit4=P1A2OE	1=P1A2输出到PA1  0=不输出
                            // Bit3=P1A1NOE	1=P1A1N输出到PB6 0=不输出
                            // Bit2=P1A1OE	1=P1A1输出到PB5	 0=不输出
                            // Bit1=P1A0NOE	1=P1A0N输出到PB1 0=不输出
                            // Bit1=P1A0OE	1=P1A0输出到PA6	 0=不输出
                            
    P1CON=0B10000001;       //Bit7=1 当故障条件被清除时，P1BEVT自动清零，PWM自动重启
                            //死区时间=Bit<6:0>*(1/Fosc)*2=1*(1/16000000)*2=0.125us
    
    P1POL=0B00000000;       // Bit7=P1C0P输出极性	1=反向	 0=不反向
                            // Bit6=P1B0P输出极性	1=反向	 0=不反向
                            // Bit5=P1A2NP输出极性	1=反向	 0=不反向
                            // Bit4=P1A2P输出极性	1=反向	 0=不反向
                            // Bit3=P1A1NP输出极性	1=反向	 0=不反向
                            // Bit2=P1A1P输出极性	1=反向	 0=不反向
                            // Bit1=P1A0NP输出极性	1=反向	 0=不反向
                            // Bit1=P1A0P输出极性	1=反向	 0=不反向
                            
    P1POL2=0B11100110;      // Bit7=P1D2P输出极性	1=反向	 0=不反向
                            // Bit6=P1D1P输出极性	1=反向	 0=不反向
                            // Bit5=P1D0P输出极性	1=反向	 0=不反向
                            // Bit2=P1C1P输出极性	1=反向	 0=不反向
                            // Bit1=P1B1P输出极性	1=反向	 0=不反向
    
    P1ADTH=0;
    P1ADTL =3;              //P1A占空比3/32
    
	P1BDTH=0;
    P1BDTL=10;              //P1B占空比10/32
    
   	P1CDTH=0;
   	P1CDTL=26;              //P1C占空比26/32
    
   	P1DDTH=0;
    P1DDTL =29;             //P1D占空比29/32

	T2CON0=T2CON0|0x04;     //Timer2使能
    
 	PCON = 0B01000011;              //检测电压设置为3.0V 
	//Bit[7:4]: 低电压侦测选择位 0100-3.0V
    //Bit3:     低电压侦测使能。 1-使能 0-关闭
    //Bit2:     低电压标志位，只读。 1-VDD掉了设置电压以下 0-VDD正常
    //Bit1:     上电复位标志，低有效。0-发生了上电复位 1-没有发生
    //Bit0:     低电压复位标志，低有效。0-发生了低电压复位 1-没有发生  
    
    LVDCON = 0B00001011;            //LVD输入脚选择PA0
    //Bit4:     LVDW极性 0-检测电压<设置电压 1-检测电压>设置电压
    //Bit3:     LVD消抖 0-关闭 1-使能
    //Bit[2:0]：LVD输入脚选择  011-PA0
 
	P1BR0	= 0B00110000;           //故障源选择LVD事件
	//Bit7:     pwm1故障事件状态位 1：发生了故障事件 0：未发生故障事件
	//Bit[6:4]: pwm1故障源选择位 
    //          000=禁止故障刹车功能 001=BK0为低电平 010=BK0为高电平
	//          011=LVDW=1 100=BK0为低电平或LVDW=1 101=BK0位高电平或LVDW=1
	//Bit[3:2]: 故障下，P1B管脚的状态 00=高阻 01=无效电平 1X=有效电平
	//Bit[1:0]: 故障下，P1A管脚的状态 00=高阻 01=无效电平 1X=有效电平
}
