// Project: FT61FC3x_Timer2.prj
// Device:  FT61FC3x
// Memory:  PROM=3Kx14, SRAM=256, EEPROM=128                             
// Description: 当DemoPortIn悬空或者高电平时，DemoPortOut输出5KHz占空比50%的波形	    
//		    	当DemoPortIn接地时，DemoPortOut输出高电平-Timer2实现
//
// RELEASE HISTORY
// VERSION DATE     DESCRIPTION
// 1.0	   24-1-16	初版
// 1.1	   24-1-24  更新版本号 
// 1.2     24-2-26  更新文件头描述
//
//                  FT61FC35  SOP20
//                 ----------------
//  GND-----------|1(GND)   (VDD)20|------------VDD        
//  NC------------|2(PC1)   (PA0)19|------------NC 
//  NC------------|3(PC0)   (PA1)18|------------NC
//  NC------------|4(PB7)   (PA2)17|----DemoPortIn
//  NC------------|5(PB6)   (PA3)16|------------NC
//  NC------------|6(PB5)   (PA4)15|---DemoPortOut
//  NC------------|7(PB4)   (PA5)14|------------NC
//  NC------------|8(PB3)   (PA6)13|------------NC
//  NC------------|9(PB2)   (PA7)12|------------NC
//  NC------------|10(PB1)  (PB0)11|------------NC
//                 ----------------   
// 
//========================================================
#include "SYSCFG.h"
//========================================================
#define  unchar         unsigned char 

#define  DemoPortOut	PA4   
#define  DemoPortIn		PA2
/*-------------------------------------------------
 *  函数名：interrupt ISR
 *	功能：  中断处理程序
 *  输入：  无
 *  输出：  无
 --------------------------------------------------*/
void interrupt ISR(void)			
{ 
	if(TMR2IE && TMR2IF)			//100us中断一次 = 5KHz
	{
		TMR2IF = 0;
		DemoPortOut = ~DemoPortOut; //翻转电平
	} 
} 
/*-------------------------------------------------
 *  函数名：POWER_INITIAL
 *	功能：  上电系统初始化
 *  输入：  无
 *  输出：  无
 --------------------------------------------------*/	
void POWER_INITIAL (void) 
{ 
	OSCCON = 0B01110001;	       //IRCF=111=16MHz/2T=8MHz，0.125us
    OPTION = 0B00001000;           //Bit3=1 WDT，Bit[2:0]=000=WDT RATE 1:1
	INTCON = 0;  			       //暂禁止所有中断
	PORTA  = 0B00000000;		
	TRISA  = 0B00000100;	       //PA输入输出 0-输出 1-输入
							       //PA4-OUT PA2-IN		
	PORTC  = 0B00000000; 	
	TRISC  = 0B00000000;	       //PC输入输出 0-输出 1-输入  
								
	WPUA   = 0B00000100;           //PA端口上拉控制 1-开上拉 0-关上拉
							       //开PA2上拉
	WPUC   = 0B00000000;           //PC端口上拉控制 1-开上拉 0-关上拉
}
/*-------------------------------------------------
 * 函数名：  TIMER2_INITIAL
 * 功能：    初始化设置定时器2 
 * 寄存器：  T2CON TMR2 PR2 PIE1 PIR1 INTCON
 * 设置TMR2定时时长=(PR+1)*Tt2ck*TMR2预分频
 *                 =(199+1)*(1/16000000)*2*4=100us
 -------------------------------------------------*/
void TIMER2_INITIAL (void) 
{    
    T2CON0  = 0B00000001; 			//TMR2 预分频1:1，后分频1:4
    //Bit7:    更新周期和占空比及时生效位 0-正常更新 1-立即更新
    //Bit[6:3]:定时器2输出后分频比选择 0000-1:1
    //Bit2:    TMR2使能位  0-关闭定时器2；1-打开定时器2
    //Bit[1:0]:定时器2输出预分频比选择 01-1:4
    
	T2CON1  = 0B00000000;		   //Bit[2:0]=000，TMR2时钟来自指令时钟
    						
    TMR2H  	= 0;					
    TMR2L  	= 0;
    
	PR2H    = 0; 					
	PR2L    = 199;	  
		 					
	TMR2IF  = 0;					//清零TMR2中断标志
	TMR2IE  = 1;					//使能TMR2中断
	TMR2ON  = 1;					//使能TMR2启动
	PEIE    = 1;    				//使能外设中断
	GIE     = 1;   					//使能全局中断
}
/*-------------------------------------------------
 *  函数名:  main 
 *	功能：  主函数
 *  输入：  无
 *  输出：  无
 --------------------------------------------------*/
void main()
{
	POWER_INITIAL();		        //系统初始化
	TIMER2_INITIAL();  		        //初始化TMR2
	
	while(1)
	{ 
		if(DemoPortIn)             //判断输入是否为高电平 
		{
			TMR2IE = 1; 	       //开定时器2 
		}
		else
		{
			TMR2IE = 0; 	       //关定时器2
			DemoPortOut = 1;
		}  
	}
}