// Project: FT61FC3x_Timer1.prj
// Device:  FT61FC3x
// Memory:  PROM=3Kx14, SRAM=256, EEPROM=128                             
// Description: DemoPortOut输出1KHz占空比50%的波形-Timer1实现
//
// RELEASE HISTORY
// VERSION DATE     DESCRIPTION
// 1.0	   24-1-16	初版
// 1.1	   24-1-24  更新版本号 
// 1.2     24-2-26  更新文件头描述
//
//                  FT61FC35  SOP20
//                 ----------------
//  GND-----------|1(GND)   (VDD)20|------------VDD        
//  NC------------|2(PC1)   (PA0)19|------------NC 
//  NC------------|3(PC0)   (PA1)18|------------NC
//  NC------------|4(PB7)   (PA2)17|------------NC
//  NC------------|5(PB6)   (PA3)16|------------NC
//  NC------------|6(PB5)   (PA4)15|---DemoPortOut
//  NC------------|7(PB4)   (PA5)14|------------NC
//  NC------------|8(PB3)   (PA6)13|------------NC
//  NC------------|9(PB2)   (PA7)12|------------NC
//  NC------------|10(PB1)  (PB0)11|------------NC
//                 ----------------   
// 
#include "SYSCFG.h"
//==========================================================
//DEFINE
//==========================================================
#define  unchar         unsigned char 
#define  DemoPortOut	PA4   
/*-------------------------------------------------
 *  函数名：interrupt ISR
 *	功能：  定时器1中断
 *  输入：  无
 *  输出：  无
 --------------------------------------------------*/
void interrupt ISR(void)           
{ 
	 if(TMR1IF)                     //500us中断一次 = 1KHz
	{
		TMR1IF = 0;                 //清零中断标志位
		DemoPortOut = ~DemoPortOut; //翻转电平
	} 
}  
/*-------------------------------------------------
 *  函数名：POWER_INITIAL
 *	功能：  上电系统初始化
 *  输入：  无
 *  输出：  无
 --------------------------------------------------*/	
void POWER_INITIAL (void) 
{
	 
	OSCCON = 0B01110001;            //IRCF=111=16MHz/2T=8MHz，0.125us                       
    OPTION = 0B00001000;            //Bit3=1 WDT，Bit[2:0]=000=WDT RATE 1:1
	INTCON = 0;                     //暂禁止所有中断
    
	PORTA = 0B00000000;
	TRISA = 0B00000000;	            //PA输入输出 0-输出 1-输入
						            //PA4-OUT
	PORTC = 0B00000000; 
	TRISC = 0B00000000;	            //PC输入输出 0-输出 1-输入  
    
	WPUA = 0B00000000;              //PA端口上拉控制 1-开上拉 0-关上拉	
	WPUC = 0B00000000;              //PC端口上拉控制 1-开上拉 0-关上拉
}
/*-------------------------------------------------
 * 函数名称：  TIMER1_INITIAL
 * 功能：      初始化设置定时器1 
 * 相关寄存器：T1CON0 T2CON0 TMR1 PR1 PIR1
 * 设置TMR1定时时长=PR1*T1ck*TMR1预分频
 *                 =250*(1/16000000)*2*16=500us
 -------------------------------------------------*/
void TIMER1_INITIAL (void) 
{
	T1CON0  = 0B00010000; 	        //预分频器分配给TMR1，时钟源为指令时钟
    //Bit4:    预分频器分配位 0-Timer2 1-Timer1
    //Bit3:    睡眠时T1CK保持工作 0-NO 1-YES
    //Bit2:    TMR1使能位  0-关闭 1-使能
    //Bit[1:0]:Timer1时钟源 00-指令时钟
    
    T2CON0  = 0B00000011; 	        //Bit[1:0]=11 TMR1预分频1:16
    
	TMR1L = 0;      			    
	TMR1H = 0;
    
    PR1L = 250;
    PR1H = 0;       
    
    TMR1IF = 0;
	T1ON = 1;                       //使能TIMER1启动
}
/*-------------------------------------------------
 *  函数名:  main 
 *	功能：  主函数
 *  输入：  无
 *  输出：  无
 --------------------------------------------------*/
void main()
{
	POWER_INITIAL();	             //系统初始化
	TIMER1_INITIAL(); 
    
	GIE = 1;                         //使能全局中断
    PEIE = 1;                        //使能外设中断
	TMR1IE = 1;                      //使能定时器1中断
	while(1)
	{
		NOP(); 
	}
}